<template>
  <ve-line :data="chartData" width="650px"></ve-line>
</template>

<script>
  export default {
    layout: 'main',
    data: function () {
      return {
        chartData: {
          columns: ['日期', '访问用户', '注册用户', '下单率'],
          rows: [
            // { '日期': '星期日', '访问用户': 393, '注册用户': 43, '下单率': 78 },
            // { '日期': '星期一', '访问用户': 193, '注册用户': 13, '下单率': 32 },
            // { '日期': '星期二', '访问用户': 330, '注册用户': 30, '下单率': 26 },
            // { '日期': '星期三', '访问用户': 223, '注册用户': 23, '下单率': 76 },
            // { '日期': '星期四', '访问用户': 123, '注册用户': 13, '下单率': 49 },
            // { '日期': '星期五', '访问用户': 392, '注册用户': 32, '下单率': 323 },
            // { '日期': '星期六', '访问用户': 153, '注册用户': 42, '下单率': 508 },

            { '日期': '1', '访问用户': 523, '注册用户': 142, '下单率': 758 },
            { '日期': '2', '访问用户': 153, '注册用户': 542, '下单率': 358 },
            { '日期': '3', '访问用户': 553, '注册用户': 4002, '下单率': 408 },
            { '日期': '4', '访问用户': 153, '注册用户': 42, '下单率': 520 },
            { '日期': '5', '访问用户': 53, '注册用户': 142, '下单率': 450 },
            { '日期': '6', '访问用户': 583, '注册用户': 142, '下单率': 858 },
            { '日期': '7', '访问用户': 53, '注册用户': 3442, '下单率': 258 },
            { '日期': '8', '访问用户': 536, '注册用户': 2142, '下单率': 408 },
            { '日期': '9', '访问用户': 753, '注册用户': 1242, '下单率': 808 },
            { '日期': '10', '访问用户': 153, '注册用户': 842, '下单率': 208 },
            { '日期': '11', '访问用户': 523, '注册用户': 142, '下单率': 758 },
            { '日期': '12', '访问用户': 153, '注册用户': 542, '下单率': 358 },
            { '日期': '13', '访问用户': 553, '注册用户': 4002, '下单率': 408 },
            { '日期': '14', '访问用户': 153, '注册用户': 42, '下单率': 520 },
            { '日期': '15', '访问用户': 53, '注册用户': 142, '下单率': 450 },
            { '日期': '16', '访问用户': 583, '注册用户': 142, '下单率': 858 },
            { '日期': '17', '访问用户': 53, '注册用户': 3442, '下单率': 258 },
            { '日期': '18', '访问用户': 536, '注册用户': 2142, '下单率': 408 },
            { '日期': '19', '访问用户': 753, '注册用户': 1242, '下单率': 808 },
            { '日期': '20', '访问用户': 153, '注册用户': 842, '下单率': 208 },
            { '日期': '21', '访问用户': 523, '注册用户': 142, '下单率': 758 },
            { '日期': '22', '访问用户': 153, '注册用户': 542, '下单率': 358 },
            { '日期': '23', '访问用户': 553, '注册用户': 4002, '下单率': 408 },
            { '日期': '24', '访问用户': 153, '注册用户': 42, '下单率': 520 },
            { '日期': '25', '访问用户': 53, '注册用户': 142, '下单率': 450 },
            { '日期': '26', '访问用户': 583, '注册用户': 142, '下单率': 858 },
            { '日期': '27', '访问用户': 53, '注册用户': 3442, '下单率': 258 },
            { '日期': '28', '访问用户': 536, '注册用户': 2142, '下单率': 408 },
            { '日期': '29', '访问用户': 753, '注册用户': 1242, '下单率': 808 },
            { '日期': '30', '访问用户': 153, '注册用户': 842, '下单率': 208 },
            { '日期': '31', '访问用户': 153, '注册用户': 542, '下单率': 358 }
          ]
        }
      }
    }
  }
</script>